import React, { Component } from 'react';
import Texts from "./texts/texts"
import Inform from "./inform/inform"
import "./aboutus.css";

class About extends Component {
    state = {
        about: [
            {tabs: "#tab0", title: "Ողջույնի խոսք", image: "aboutus/one.png", textes:[
                "Հարգելի այցելունե՛ր,",
                "Ողջունում  եմ ձեզ «Նաիրի» բժշկական կենտրոնի պաշտոնական կայքում:",
                "«Նաիրի» բժշկական կենտրոնը ՀՀ առաջատար բժշկական հաստատություն է, որտեղ տեղացի և օտարերկրյա պացիենտներին ցուցաբերվում է միջազգային չափանիշներին համապատասխան բարձրորակ և բազմապրոֆիլային բուժօգնություն:",
                "Այսօր «Նաիրի» բժշկական կենտրոնում պացիենտի բուժման գործընթացում կիրառվում են նորարարական տեխնոլոգիաներ և մեթոդներ:",
                "Մասնագետների գիտական, կլինիկական և կրթական գործունեության, միջազգային առաջատար բժշկական հաստատությունների հետ համագործակցության, առաջատար ընկերությունների ժամանակակից տեխնոլոգիաների և մեթոդաբանությունների ներդրման շնորհիվ «Նաիրի» բժշկական կենտրոնը ձեռք է բերել լայն ճանաչում մեր երկրում և արտասահմանում:",
                "«Նաիրի» ԲԿ-ում ստեղծվել են տարբեր մասնագիտական ուղղվածության բազմապրոֆիլ թիմեր, ինչը առավելություն է պացիենտի ճշգրիտ և արագ ախտորոշման ու արդյունավետ բուժման գործընթացում` հատկապես բարդ ու դժվարին դեպքերում: Վիրաբուժական բազմամասնագիտական թիմը հնարավորություն է տալիս համալիր և համակցված վիրաբուժական ախտաբանությունների դեպքում կատարել միաժամանակյա համատեղ վիրահատություն:",
                "Ստեղծված է նաև ուռուցքաբանական թիմ, որը ներառում է տարբեր ոլորտներից մասնագիտացված ուռուցքաբաններ: Դա թույլ է տալիս նույնիսկ շատ բարդ դեպքերում արագ և ճշգրիտ ախտորոշել ու համատեղ մշակել քաղցկեղով հիվանդների բուժման միասնական "
            ]},
            {tabs: "#tab1", title: "Պատմությունից", image: "aboutus/two.png", textes:[
                "«Նաիրի» բժշկական կենտրոնն իր գործունեությունը սկսել է 2005թ. հիմնովին վերակառուցված և նոր սարքերով համալրված շինությունում: Կենտրոնի գործունեության հիմնական նպատակը միջազգային չափանիշներին համապատասխան ախտորոշման և բուժման ապահովումն է: Աշխարհի լավագույն կլինիկաների և միջազգային ընկերությունների հետ համագործակցության շնորհիվ՝ կենտրոնը շարունակում է ընդլայնել իր հնարավորությունները, ինչը հնարավորություն է տալիս ապահովել բազմապրոֆիլային բարձրորակ բժշկական ծառայություն:"
            ]},
            {tabs: "#tab2", title: "Մեր հեռանկարները", image: "aboutus/three.png", textes:[
                "Մեր նպատակն է պացիենտին բժշկական օգնության մարդասիրական որակն ապահովելու մեջ առողջապահության բնագավառում լինել առաջատարը: «Նաիրի» բժշկական կենտրոնը Հայաստանի և հարևան շրջանների համար բժշկական ծառայությունների լավագույն մատակարարներից է."
                ],
                uls: [
                    "առաջընայիններից է` պացիենտներին լավագույնը սպասարկելու գործընթացում,",
                    "հարմարավետներից է` պացիենտների և բուժանձնակազմի համար,",
                    "ժամանակակից բժշկական սարքերով զինված ամբուլատոր և մասնագիտացված բժշկական հաստատություն է,",
                    "հագեցած է մեթոդոլոգիական միջոցներով և նորագույն բժշկական տեխնոլոգիաներով,",
                    "յուրաքանչյուր պացիենտին ցուցաբերած ծառայության որակի շնորհիվ ճանաչվածը:"
                ]
            },
            {tabs: "#tab3", title: "Մեր արժեքները", image: "aboutus/four.png", textes:[
                "Մենք շարունակում ենք  բարձր չափանիշներով առաջ շարժվել` դարին  և տեխնոլոգիաներին համահունչ` հաստատելով ավելի ուժեղ և արդյունավետ բուժօգնություն տրամադրող կազմակերպություն:",
                "Մենք բարելավում ենք բժշկական սպասարկման ծառայությունների որակը` սարքերի արդիականացման, նոր մեթոդների ներդրման միջոցով, ներգրավելով պացիենտներին մասնակցելու իրենց բուժման գործընթացին` մասնագետների հետ համատեղ:",
                "Մենք կարեկցանքով, բարությամբ և հարգանքով ենք բուժում անհատներին, ընտանիքներին:",
                "Մենք հիշում ենք ՙխանդավառություն է պետք՚ արտահայտության բուն իմաստը և կատարում ենք մեր աշխատանքը նույն կերպ ու համոզմունքով, որով առաջին անգամ ոգեշնչվել ենք առողջապահության ոլորտն ընտրելիս:"
            ]},
            {tabs: "#tab4", title: "Համագործակցություն", image: "aboutus/five.png", textes:[
                "Տարբեր ոլորտների և պրոֆիլների մասնագետների միջդիսցիպլինար համագործակցությունը, հմտությունների և գիտելիքների փոխանակումը, շարունակական հետադարձ կապը մեր պացիենտների համար ստեղծում է համապարփակ մոտեցում` բժշկական սպասարկման հարցում:",
                "Մենք ստեղծում ենք վստահության, համագործակցության անկեղծ մթնոլորտ:"
            ]}
        ],
        more: [
            {link: "/why-apply-to-us", image: "more/one.png", title: "Ինչու՞ դիմել մեզ", text: "Ստեղծված են բոլոր հարմարավետ պայմանները` լուծելու պացիենտի ցանկացած խնդիր..."},
            {link: "/how-to-get-us", image: "more/two.png", title: "Ինչպե՞ս հասնել «Նաիրի» ԲԿ", text: "Եթե Դուք «Զվարթնոց» օդանավակայանում եք, կամ արդեն` Երևանում..."},
            {link: "/doctors", image: "more/three.png", title: "Մեր բժիշկները", text: "Սեղմելով հղումը` Դուք կարող եք կապ հաստատել նախընտրած մասնագետի հետ..."}
        ]
    }
    render() {
        const abouts = this.state.about
        const mores =this.state.more
        return (
            <div className="bgc">
                <a href="/" className="ttl">Գլխավոր</a>
                <p className="ttl1">/ Մեր մասին</p>
                <p className="ttls">Մեր մասին</p>
                <center>
                    <p className="nbk">Նաիրի բժշկական կենտրոն</p>
                    <p className="bh">Բազմապրոֆիլ հիվանդանոց</p>
                </center>
                    <Texts list={abouts} />
                <center>
                    <p className="nbkk">Նաիրի ԲԿ-ն կազմակերպում է արտերկրի պացիենտների բժշկական տուրիզմի նպատակով Հայաստան այցելելու ամբողջ փաթեթը</p>
                    <p className="if">Եթե Հայաստանում չեք</p>
                    <p className="help">Մենք կօգնենք Ձեզ պլանավորել Ձեր այցը և մնալը Հայաստանում</p>
                    <a href="foreigners" className="more">ավելին</a>
                </center>
                <center className="about">
                    <p className="nbks">Ավելին` «Նաիրի» բժշկական կենտրոնի մասին</p>
                    <div className="rowss">
                        {mores.map((elem) => {
                            return <Inform data={elem} />
                        })}
                    </div>

                </center>
                <center className="btb">
                    <p className="bt" >Բժշկական տուրիզմի մասին ավելին իմանալու համար սեղմեք ստորև հղումը</p>
                    <a href="medical-tourism" className="more">բժշկական տուրիզմ</a>
                </center>
            </div>

        )

    }

}
export default About